<template>
  <div class="min-h-screen bg-custom-bg2 bg-cover pt-[69px] font-normal font-raleway text-gray 
    px-[30px] md:px-[50px] lg:px-[90px] xl:px-[180px] 2xl:px-[280px]">
    <nav class="mb-[50px] sm:mb-[64px] text-[16px] md:text-[20px]">
      <a href="/" class="hover:underline opacity-50">Главная</a> 
      <span class="mx-5 opacity-50">→</span>
      <a href="/" class="hover:underline opacity-50">Блог</a>
      <span class="mx-5 opacity-50">→</span>
      <span>На что обратить внимание при разработке сайта визитки?</span>
    </nav>
    <div class="pr-[0px] lg:pr-[200px] xl:pr-[250px] 2xl:pr-[300px]">
      <h1 class="text-[32px] sm:text-[40px] md:text-[50px] leading-[42px] sm:leading-[50px] md:leading-[65px] text-darkblue font-catallina text-transform: uppercase mb-[25px]">
        На что обратить внимание при разработке сайта визитки?
      </h1>
      <div class="flex flex-col xs:flex-row text-[15px] text-darkblue pb-[35px] md:pb-[45px]
        space-y-5 xs:space-y-0 space-x-[0px] xs:space-x-[70px] sm:space-x-[100px] md:space-x-[169px]">
        <div class="flex space-x-[10px]">
            <div class="px-[10px] sm:px-[14px] py-[3px] sm:py-[7px] border border-darkblue rounded-[20px] opacity-60">Сайты</div>
            <div class="px-[10px] sm:px-[14px] py-[3px] sm:py-[7px] border border-darkblue rounded-[20px] opacity-60">Бизнес</div>    
        </div>
        <div class="flex space-x-[15px] my-auto">
            <div class="flex space-x-[6px] xs:space-x-[10px]">
              <svg width="19" height="20" viewBox="0 0 19 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M4.27788 0.0201793C3.62371 0.138232 3.04594 0.682462 2.87453 1.34211C2.8314 1.50809 2.82405 1.62204 2.81936 2.19749L2.81392 2.8614L1.95392 2.87424C1.09689 2.88702 1.09335 2.88727 0.924791 2.95223C0.502129 3.11513 0.166906 3.48687 0.0444276 3.92854C0.00166717 4.08277 -0.000250778 4.40973 1.97021e-05 11.4425C0.000265593 17.7906 0.00518335 18.8135 0.0359935 18.9293C0.161373 19.4004 0.542775 19.7942 1.02017 19.9455L1.1923 20H9.18375C16.8717 20 17.1808 19.9983 17.3227 19.9548C17.4039 19.9299 17.5345 19.8755 17.613 19.8339C17.7987 19.7353 18.0847 19.4325 18.1895 19.2234C18.3558 18.8916 18.3432 19.5284 18.3432 11.4307C18.3432 3.41497 18.3531 3.97371 18.2054 3.67857C18.0622 3.3923 17.8305 3.15984 17.544 3.01513C17.3052 2.89445 17.2682 2.89002 16.3761 2.87537L15.5277 2.8614L15.5231 2.19535C15.5177 1.4329 15.4995 1.313 15.3387 0.980482C15.2548 0.806981 15.1978 0.73164 15.0016 0.53569C14.7994 0.333715 14.7319 0.283405 14.5319 0.185713C14.1794 0.0135647 14.0153 -0.0108522 13.307 0.00345866C12.6659 0.0163925 12.5811 0.0309492 12.282 0.179099C11.9433 0.346821 11.6537 0.641939 11.4698 1.00664C11.3169 1.3098 11.305 1.38807 11.2927 2.16676L11.2816 2.87369H9.16922H7.0568L7.05593 2.25282C7.05475 1.39542 7.00858 1.16969 6.7576 0.794441C6.53883 0.467357 6.18843 0.200811 5.81556 0.0778405C5.6263 0.0154088 5.5935 0.0125319 5.00361 0.00645838C4.66551 0.00299132 4.33894 0.00916334 4.27788 0.0201793ZM5.52649 1.55628L5.61833 1.64045L5.62497 3.38847C5.63245 5.36305 5.64317 5.24802 5.44358 5.33629C5.34505 5.37989 5.28867 5.38407 4.89379 5.37718C4.49439 5.3702 4.44738 5.36479 4.38445 5.31856C4.22302 5.19999 4.22912 5.27467 4.2291 3.41837C4.22905 1.55798 4.22408 1.61778 4.38691 1.51849C4.45426 1.47743 4.51652 1.47229 4.94865 1.47221L5.43463 1.47212L5.52649 1.55628ZM13.9393 1.50775C13.9772 1.52734 14.0292 1.57436 14.0549 1.61225C14.0995 1.67803 14.1019 1.75804 14.108 3.39007C14.1141 4.98157 14.1115 5.10481 14.0712 5.18332C14.0473 5.2297 13.9966 5.29056 13.9583 5.31856C13.8936 5.366 13.8557 5.36949 13.4051 5.36949C12.9444 5.36949 12.9176 5.36688 12.8446 5.3148C12.8025 5.28473 12.7552 5.22933 12.7396 5.19173C12.719 5.14179 12.7131 4.65453 12.7179 3.38576L12.7246 1.64817L12.7861 1.58205C12.8199 1.54569 12.8697 1.50676 12.8967 1.49557C12.9238 1.48439 13.1539 1.47453 13.4082 1.47367C13.7661 1.47246 13.886 1.48016 13.9393 1.50775ZM16.9355 12.8753L16.9417 18.5861H9.17151H1.4013V12.8856C1.4013 9.75023 1.4087 7.1776 1.41773 7.16855C1.42678 7.15952 4.92057 7.1549 9.18174 7.15829L16.9293 7.16449L16.9355 12.8753Z" fill="#0B0590"/>
              </svg>
              <p>Авг 2023</p>
            </div>
            <div class="flex space-x-[10px]">
              <svg width="22" height="20" viewBox="0 0 22 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M11.5723 0.0240684C11.2456 0.133683 11.0212 0.357783 10.9185 0.677166C10.8112 1.01064 10.8715 1.48978 11.0503 1.72393C11.241 1.97367 11.4943 2.05805 12.1672 2.09593C12.7017 2.12604 12.9205 2.15165 13.3079 2.2295C14.562 2.48153 15.7988 3.07832 16.8106 3.91962C17.2284 4.26703 17.7764 4.84317 18.1031 5.27841C19.005 6.48022 19.5346 7.85053 19.6739 9.34298C19.7356 10.0034 19.6764 10.9364 19.5267 11.6623C19.0484 13.9827 17.4309 16.0619 15.2616 17.1449C13.3384 18.105 11.131 18.2404 9.06976 17.5245C7.30517 16.9116 5.78467 15.6594 4.83936 14.0405C4.32305 13.1562 3.96784 12.1006 3.85257 11.108C3.83822 10.9844 3.82119 10.8434 3.81473 10.7946L3.80298 10.7059H4.71551C5.48822 10.7059 5.62683 10.7008 5.62035 10.6726C5.61056 10.63 2.82608 5.99969 2.81028 5.99978C2.79472 5.99988 0.0101362 10.631 0.00020348 10.6733C-0.00618182 10.7005 0.134673 10.7059 0.854249 10.7059H1.71593L1.73211 10.9365C1.74098 11.0633 1.76966 11.3161 1.79582 11.4982C2.23808 14.5774 4.0574 17.2285 6.79518 18.7832C7.79436 19.3506 8.97774 19.7638 10.1136 19.9418C10.4724 19.9981 10.5245 20 11.715 20C12.9185 20.0001 12.9537 19.9987 13.3114 19.9404C15.8115 19.5324 18.051 18.1929 19.6367 16.1572C20.433 15.1349 21.0841 13.8082 21.4068 12.5506C21.6319 11.6732 21.7173 10.9751 21.7163 10.0201C21.7154 9.17382 21.6519 8.58129 21.4806 7.82071C21.0403 5.86633 19.9896 4.04335 18.5182 2.68085C16.7236 1.01904 14.4437 0.0741103 12.0595 0.00389565C11.7678 -0.00471267 11.6426 0.000490086 11.5723 0.0240684ZM11.466 4.0044C11.2414 4.08493 11.0542 4.25866 10.948 4.48507L10.8865 4.61623L10.8802 7.37137L10.874 10.1265L9.52981 11.4745C8.79053 12.2159 8.16374 12.8598 8.13694 12.9053C8.04651 13.059 8.00592 13.2518 8.01921 13.4648C8.06273 14.1621 8.77039 14.578 9.38997 14.2703C9.55199 14.1899 9.65354 14.0931 11.1138 12.6286C12.4697 11.2688 12.6741 11.0546 12.7338 10.9306L12.8021 10.7887V7.70246V4.61623L12.7239 4.46649C12.6244 4.27583 12.4698 4.12125 12.2983 4.04085C12.1779 3.98442 12.1321 3.97709 11.8679 3.97198C11.6442 3.96768 11.5465 3.97555 11.466 4.0044ZM15.7226 5.61835C15.5242 5.68345 15.3647 5.84294 15.3084 6.03254C15.2354 6.27828 15.2856 6.48261 15.4623 6.65936C15.8391 7.03612 16.4646 6.80861 16.5197 6.27478C16.5445 6.03476 16.4026 5.77422 16.1873 5.66427C16.0812 5.61007 15.825 5.58476 15.7226 5.61835ZM17.1496 9.45026C16.8825 9.51844 16.6694 9.78754 16.6689 10.0572C16.6686 10.186 16.7364 10.3625 16.8265 10.4678C17.1776 10.8779 17.8598 10.6648 17.9152 10.1276C17.9314 9.97101 17.8759 9.776 17.7836 9.66454C17.6442 9.49647 17.3535 9.39821 17.1496 9.45026ZM15.6518 13.191C15.5212 13.25 15.404 13.3594 15.337 13.4847C15.2984 13.5568 15.2862 13.6215 15.2858 13.7567C15.2853 13.9115 15.2945 13.9506 15.3582 14.0641C15.4914 14.3017 15.757 14.4258 16.0167 14.3719C16.4894 14.2738 16.6805 13.7201 16.3677 13.3547C16.1957 13.1538 15.8891 13.0836 15.6518 13.191ZM11.4776 15.1603C11.3469 15.2211 11.2195 15.3514 11.1634 15.4813C11.1072 15.6118 11.1144 15.8517 11.1786 15.9843C11.24 16.1112 11.3846 16.2512 11.5099 16.3052C11.7087 16.3908 11.9824 16.3395 12.1704 16.1813C12.4286 15.964 12.4272 15.4744 12.1676 15.2553C11.9773 15.0946 11.7004 15.0565 11.4776 15.1603Z" fill="#0B0590"/>
              </svg>
              <p>8 мин.</p>
            </div>
        </div>
      </div>
      <p class="text-[16px] md:text-[20px] leading-[25px] md:leading-[30px] mb-[40px] md:mb-[50px]">
        (краткое содержание) Какие стили сайтов бывают, какие из них популярны, как отличить один от другого, что выбрать? 
        Эти вопросы возникают как у начинающих веб-дизайнеров, так и у заказчиков.
      </p>
    </div>
    <Accordion
      v-for="(accordion, index) in accordions"
      :key="index"
      :title="accordion.title"
    >
      <ol class="list-decimal list-inside text-[16px] md:text-[20px] leading-[30px] md:leading-[40px]">
        <li>Определение целей и задач</li>
        <li>Анализ конкурентов и рынка</li>
        <li>Платформа</li>
        <li>Функциональность</li>
        <li>Составление технического задания</li>
        <li>Проектирование</li>
        <li>Разработка дизайна</li>
        <li>Верстка</li>
        <li>Программирование</li>
        <li>Наполнение контентом</li>
        <li>Тестирование и запуск</li>
        <li>Запуск и продвижение</li>
        <li>Заключение</li>
      </ol>
    </Accordion>
    <div class="pr-[0px] lg:pr-[200px] xl:pr-[250px] 2xl:pr-[300px] text-[16px] md:text-[20px] leading-[30px] md:leading-[40px]">
      <p class="mb-[40px] md:mb-[50px]">
        Интерес к интернет-магазинам возрастает с каждым годом. В сумасшедшем жизненном темпе люди не готовы тратить много времени на поиски нужных вещей. 
        Гораздо приятнее и рациональнее делать покупки онлайн. Это экономит время, ресурсы покупателей, а владельцам бизнеса позволяет с минимальными затратами 
        получать максимальную выгоду. Только есть один важный нюанс — перед созданием сайта необходимо продумать его и соблюдать последовательность этапов. 
        Каких? О том, какие основные этапы разработки интернет-магазина стоит пройти, расскажем ниже.
      </p>
      <h2 class="text-[20px] sm:text-[25px] md:text-[30px] leading-[38px] sm:leading-[45px] md:leading-[60px] text-darkblue font-bold mb-[20px]">
        Определение целей и задач
      </h2>
      <p class="mb-[40px] md:mb-[50px]">
        Обязательно на этом этапе необходимо понимать, какие услуги/товары вы будете предлагать клиентам, кто ваша целевая аудитория, определить задачи и 
        цель создания интернет-магазина. Как правило, это минимизация затрат и получение максимальной прибыли.
        Задачи веб-ресурса тоже могут быть различными. Например, увеличение прибыли, выход на новый рынок.
      </p>
      <div class="mb-[40px] md:mb-[50px]" >
        <img src="/src/assets/image1.png"/>
      </div>
      <h2 class="text-[20px] sm:text-[25px] md:text-[30px] leading-[38px] sm:leading-[45px] md:leading-[60px] text-darkblue font-bold mb-[20px]">
        Функциональность
      </h2>
      <p class="mb-[20px]">
        Функциональность интернет-магазина также имеет не последнее значение. Следует определиться, что вам нужно для успешного ведения бизнеса, 
        а без какой опции вы без труда сможете работать.
        Для интернет-магазина ключевыми составляющими является следующее:
      </p>
      <ul class="mb-[20px] pl-[20px] sm:pl-[37px] list-disc list-inside">
        <li>корзина покупок</li>
        <li>каталог товаров</li>
        <li>система доставки/оплаты</li>
        <li>поиск по сайту</li>
        <li>системы фильтрации и сортировки.</li>
      </ul>
      <p class="mb-[60px] md:mb-[100px]">
        При этом важно строить разработку с учетом возможной будущей масштабируемости и возможности в дальнейшем добавлять новые функции.
        Популярной становится тенденция не разрабатывать у себя на сайте какие-то сложные модули (умный поиск, системы лояльности и дт), а подключать 
        сторонние сервисы и пользоваться ими по подписке.
      </p>
    </div>
    <h1 class="text-[32px] sm:text-[40px] md:text-[50px] leading-[42px] sm:leading-[50px] md:leading-[65px] text-blue font-catallina text-transform: uppercase mb-[13px] text-center">
      Понравилась 
      <span class="text-gray">статья?</span>
    </h1>
    <p class="text-[16px] md:text-[20px] leading-[30px] md:leading-[40px] mb-[50px] md:mb-[67px] text-center">
      Поделитесь материалом с другими в социальных сетях или сохраните статью себе для быстрого доступа
    </p>
    <div class="flex space-x-[10px] justify-center mb-[50px] md:mb-[68px] ">
      <a href="https://vk.com/" target="_blank" rel="noopener noreferrer" class="bg-[#0077FF] rounded-full p-2">
        <svg width="24" height="24" viewBox="0 0 28 15" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.3664 1.03122C27.0513 1.92278 26.6266 2.69882 26.0945 3.40346L26.1167 3.37195C25.5939 4.15605 24.9697 5.06196 24.2439 6.08968C23.6215 6.90108 23.2921 7.32113 23.2555 7.34983C23.0945 7.5315 22.9825 7.75413 22.944 7.99881L22.9428 8.00616C22.9743 8.22879 23.0887 8.42306 23.2555 8.56798L23.7223 9.03633C26.2194 11.3459 27.6239 12.9379 27.9358 13.8123C27.9767 13.9089 28 14.0202 28 14.1368C28 14.3405 27.9277 14.5285 27.8051 14.6829L27.8075 14.6797C27.6021 14.8698 27.3151 14.9874 26.9977 14.9874C26.9627 14.9874 26.9265 14.9863 26.8926 14.9832H26.8973H23.8273C23.8261 14.9832 23.8238 14.9832 23.8215 14.9832C23.4282 14.9832 23.0665 14.8593 22.783 14.6535L22.7865 14.6556C22.3734 14.35 22.0058 14.0192 21.6768 13.66L21.6663 13.6474C21.1287 13.1007 20.6519 12.6404 20.2357 12.2665C18.8495 11.0806 17.8265 10.4876 17.1669 10.4876C17.1424 10.4855 17.1144 10.4845 17.0852 10.4845C16.8926 10.4845 16.713 10.538 16.5648 10.6294L16.5683 10.6273C16.4469 10.7638 16.3734 10.9402 16.3734 11.1303C16.3734 11.1681 16.3757 11.2038 16.3816 11.2405V11.2363C16.3501 11.5661 16.3314 11.9494 16.3314 12.3369C16.3314 12.4618 16.3337 12.5858 16.3372 12.7097V12.6918V13.9089C16.3489 13.9583 16.3559 14.015 16.3559 14.0727C16.3559 14.3269 16.2275 14.5537 16.0268 14.7039L16.0257 14.7049C15.5741 14.8908 15.0467 15 14.4901 15C14.3711 15 14.2544 14.9947 14.1389 14.9853L14.154 14.9863C12.3174 14.9548 10.6138 14.4707 9.16569 13.6548L9.20654 13.6758C7.44341 12.7118 5.9825 11.4569 4.86931 9.9741L4.83781 9.92999C3.78063 8.66774 2.79463 7.24167 1.95449 5.73789L1.87281 5.57617C1.38156 4.73397 0.872812 3.69854 0.434072 2.63372L0.364061 2.43944C0.185531 1.96059 0.0560093 1.40402 0.00233372 0.827499L0 0.801246C0 0.270582 0.346947 0.00525075 1.04084 0.00525075H4.10968C4.13769 0.0031505 4.17036 0.0021001 4.2042 0.0021001C4.49358 0.0021001 4.76079 0.091361 4.972 0.241529L4.96966 0.239429C5.20303 0.469406 5.37573 0.75189 5.46091 1.06693L5.46441 1.07953C6.02917 2.51505 6.62777 3.7206 7.31622 4.87573L7.23804 4.73187C7.80047 5.75049 8.4224 6.62734 9.13186 7.43699L9.10502 7.40444C9.72734 8.09192 10.2128 8.43566 10.5613 8.43566C10.5718 8.43671 10.5846 8.43671 10.5986 8.43671C10.7713 8.43671 10.9218 8.3527 11.0035 8.22669L11.0047 8.22459C11.091 8.02506 11.1412 7.79298 11.1412 7.55146C11.1412 7.5 11.1389 7.44854 11.1342 7.39814V7.40444V3.331C11.1097 2.85109 10.979 2.40269 10.7608 2.00049L10.7701 2.02044C10.6254 1.74321 10.4516 1.50378 10.245 1.2906L10.2485 1.29481C10.0572 1.12258 9.92649 0.896807 9.88565 0.644777L9.88448 0.638476C9.88448 0.459955 9.9755 0.299286 10.1179 0.194273L10.119 0.193223C10.2602 0.0766592 10.4492 0.0063008 10.6558 0.0063008H10.6651H15.5029C15.5286 0.00315042 15.5578 0.0021001 15.5881 0.0021001C15.8156 0.0021001 16.0198 0.0945115 16.1552 0.239429L16.1564 0.240479C16.2765 0.437903 16.3477 0.674181 16.3477 0.924111C16.3477 0.964016 16.3454 1.00287 16.3419 1.04173V1.03647V6.46878C16.3396 6.49398 16.3384 6.52338 16.3384 6.55279C16.3384 6.74601 16.3979 6.92768 16.5006 7.08205L16.4983 7.07785C16.5834 7.19126 16.7258 7.26477 16.8868 7.26477C17.0922 7.25217 17.28 7.19126 17.4376 7.09465L17.4341 7.09675C17.7515 6.90038 18.0245 6.6767 18.2614 6.42362L18.266 6.41837C18.9743 5.69798 19.6278 4.90199 20.1972 4.05559L20.2427 3.98208C20.6441 3.38351 21.0782 2.64632 21.4714 1.88918L21.5438 1.73481L22.0642 0.798095C22.245 0.329739 22.7305 0 23.3011 0C23.3232 0 23.3454 -7.61622e-08 23.3676 0.00105005H23.3641H26.4341C27.2633 0.00105005 27.5745 0.344441 27.3676 1.03122H27.3664Z" fill="white"/>
        </svg>
      </a>
      <a href="https://web.telegram.org/a/" target="_blank" rel="noopener noreferrer" class="bg-[#64A9DC] rounded-full p-2">
        <svg width="24" height="24" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M19.0243 1.45624L16.1452 15.0342C15.9278 15.9923 15.3615 16.2308 14.5567 15.7797L10.1695 12.5469L8.0529 14.5831C7.81848 14.8175 7.6229 15.0131 7.1711 15.0131L7.48661 10.5455L15.617 3.19872C15.9707 2.88389 15.54 2.70875 15.0678 3.02426L5.01634 9.35361L0.689111 7.99888C-0.251976 7.70517 -0.269012 7.05779 0.88537 6.60598L17.8106 0.0851558C18.5943 -0.208551 19.2798 0.258926 19.0243 1.45624Z" fill="white"/>
        </svg>
      </a>
      <a href="https://www.whatsapp.com/" target="_blank" rel="noopener noreferrer" class="bg-[#65BC54] rounded-full p-2"> 
        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5 3.5C18.25 1.25 15.2 0 12 0C5.41 0 0 5.41 0 12C0 14.11 0.65 16.11 1.7 17.92L0 24L6.33 22.45C8.08 23.41 10 24 12 24C18.59 24 24 18.59 24 12C24 8.81 22.76 5.76 20.5 3.5ZM12 22C10.22 22 8.52 21.41 6.99 20.51L6.63 20.29L2.87 21.28L3.87 17.61L3.63 17.23C2.64 15.65 2 13.88 2 12C2 6.52 6.52 2 12 2C14.65 2 17.2 3.05 19.08 4.93C20.96 6.81 22 9.35 22 12C22 17.48 17.47 22 12 22ZM17.5 14.45C17.2 14.3 15.73 13.58 15.46 13.48C15.19 13.38 14.99 13.33 14.79 13.63C14.59 13.93 14.02 14.6 13.84 14.8C13.67 15 13.49 15.02 13.19 14.87C12.89 14.72 11.93 14.41 10.79 13.39C9.9 12.6 9.3 11.62 9.13 11.32C8.96 11.02 9.11 10.86 9.26 10.71C9.39 10.58 9.56 10.36 9.71 10.19C9.86 10.02 9.91 9.89 10.01 9.69C10.11 9.49 10.06 9.32 9.99 9.17C9.91 9.02 9.31 7.55 9.06 6.95C8.82 6.37 8.57 6.45 8.39 6.44C8.22 6.43 8.02 6.43 7.82 6.43C7.62 6.43 7.3 6.51 7.02 6.8C6.75 7.1 5.98 7.83 5.98 9.3C5.98 10.77 7.05 12.19 7.2 12.39C7.35 12.59 9.31 15.61 12.3 16.9C13.01 17.21 13.57 17.39 14 17.53C14.72 17.76 15.37 17.73 15.88 17.65C16.45 17.56 17.65 16.93 17.9 16.23C18.15 15.53 18.15 14.93 18.07 14.81C18 14.68 17.8 14.6 17.5 14.45Z" fill="white"/>
        </svg>
      </a>
    </div>
    <h1 class="text-[32px] sm:text-[40px] md:text-[50px] leading-[42px] sm:leading-[50px] md:leading-[65px] font-catallina text-transform: uppercase mb-[40px] md:mb-[60px] text-center">
      Читайте также
    </h1>
    <div class="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-[22px] pb-[60px] md:pb-[117px]">
      <Card
          v-for="(card, index) in cards"
          :key="index"
          :id="card.id"
          :image="card.image"
          :sort="card.sort"
          :category="card.category"
          :date="card.date"
          :title="card.title"
          :description="card.description"
      />
    </div>
  </div>
</template>

<script setup>
import Accordion from '../components/Accordion.vue';
import Card from '../components/Card.vue';

  const accordions = [
    {
        title: 'Содержание',
    }
  ]

  const cards = [
    {
        id: 3,
        image: '/src/assets/kote.jpg',
        sort: 'Сайты',
        category: 'Бизнес',
        date: 'Авг 2023',
        title: 'На что обратить внимание при разработке сайта визитки?',
        description: 'Как понять, что нужен сайт? Какую информацию размещать? Как провести анализ конкурентов? Отвечаем в статье.',
    },
    {
        id: 7,
        image: '/src/assets/kote.jpg',
        sort: 'Сайты',
        category: 'Бизнес',
        date: 'Авг 2023',
        title: 'На что обратить внимание при разработке сайта визитки?',
        description: 'Как понять, что нужен сайт? Какую информацию размещать? Как провести анализ конкурентов? Отвечаем в статье.',
    },
    {
        id: 9,
        image: '/src/assets/kote.jpg',
        sort: 'Сайты',
        category: 'Бизнес',
        date: 'Авг 2023',
        title: 'На что обратить внимание при разработке сайта визитки?',
        description: 'Как понять, что нужен сайт? Какую информацию размещать? Как провести анализ конкурентов? Отвечаем в статье.',
    },
  ];
</script>

<style scoped>
.bg-custom-bg2 {
  position: relative;
}

.bg-custom-bg2::before {
  content: '';
  position: absolute;
  top: 0;
  left: 0;
  right: 0;
  bottom: 0;
  background: rgba(255, 255, 255, 0.7);
  z-index: 1; 
}

.bg-custom-bg2 > * {
  position: relative;
  z-index: 2;
}

ul li::marker {
  font-size: 0.5em;
}
ol {
  counter-reset: list-counter;
  list-style: none; 
}

ol li {
  counter-increment: list-counter;
  position: relative;
  padding-left: 2em; 
}

ol li::before {
  content: counter(list-counter) ". ";
  position: absolute;
  left: 0;
  font-weight: bold;
}
</style>
